app/Http/Controllers/User/QuestionController.php

select * from `questions`
select * from `tag_categories` where `tag_categories`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $inputs = $request->all();
        $questions =$this->question->all();
        $categorieis = $this->category->all();

        if(empty($inputs['search_word']) && empty($inputs['tag_category_id'])) {
            $inputs = $request->all();
        } elseif(array_key_exists('tag_category_id', $inputs) && empty($inputs['search_word'])) {
            $questions = $this->question->searchCategory($inputs)->get();

select * from `questions` where `questions`.`id` = '1' and `questions`.`deleted_at` is null limit 1
---
    public function show($id)
    {

        $question = $this->question->find($id);

select * from `tag_categories` where `tag_categories`.`deleted_at` is null
---
    public function edit($id)
    {
        $question = $this->question->find($id);
        $categories = $this->category->where('id', '=', 'tag_category_id')->orderBy('created_at', 'desc')->get();
        $allCategories = $this->category->all();

select * from `questions` where `questions`.`id` in ('kDDZabJh6lazXvfmdsG1KiR6VNvuS2S84If579RD', '1', 'aaa', 'aaa', 'create')
---
    public function update(QuestionsRequest $request, $id)
    {
        $input = $request->all();
        $input['user_id'] = Auth::id();
        $this->question->find($id)->fill($input)->save();