app/Models/Question.php

select * from `questions` where `user_id` = '4' and `questions`.`deleted_at` is null order by `created_at` desc
---
    public function  showMypage()
    {
        return $this->where('user_id', Auth::id())
                    ->orderBy('created_at', 'desc')
                    ->get();